In [2]:
import pandas as pd
import numpy as np

series y dataframe
series es similar a una columna 
data frame es tabla

In [3]:
etiquetas = ["a","b","c","d"," "]
datos = np.arange(4,9)
serie  = pd.Series(datos, index=etiquetas)
print(serie)

a    4
b    5
c    6
d    7
     8
dtype: int32

In [4]:
serie = pd.Series([100,500,1200,700],["Empresa1","Empresa2","Empresa3","Empresa4"])
print(serie)

Empresa1     100
Empresa2     500
Empresa3    1200
Empresa4     700
dtype: int64

In [5]:
serie1 = pd.Series([100,500,1200,700],["Empresa1","Empresa2","Empresa3","Empresa4"])
serie2 = pd.Series([40,540,1240,90],["Empresa1","Empresa2","Empresa3","Empresa4"])
serie1 = serie1 + serie2

In [6]:
filas = ["empresa1","empresa2","empresa3","empresa4"]
columnas = ["tienda1","tienda2","tienda3"] 
datos = [[np.nan,100,200],[np.nan,100,300],[100,np.nan,233],[np.nan,100,233]]
df = pd.DataFrame(datos,index=filas,columns = columnas)
print(df)

          tienda1  tienda2  tienda3
empresa1      NaN    100.0      200
empresa2      NaN    100.0      300
empresa3    100.0      NaN      233
empresa4      NaN    100.0      233

In [7]:
print(df.loc["empresa2"])

tienda1      NaN
tienda2    100.0
tienda3    300.0
Name: empresa2, dtype: float64

In [8]:
df.loc[["empresa2","empresa3"]]

          tienda1  tienda2  tienda3
empresa2      NaN    100.0      300
empresa3    100.0      NaN      233

In [9]:
# esto se puede mejorar con un operador tenaerio 
df["total"] = df["tienda1"] + df["tienda2"] + df["tienda3"]
df

          tienda1  tienda2  tienda3  total
empresa1      NaN    100.0      200    NaN
empresa2      NaN    100.0      300    NaN
empresa3    100.0      NaN      233    NaN
empresa4      NaN    100.0      233    NaN

In [10]:
# axis 1hace qeu solo se eliminen kas coloumnas 1 significa el eje de las columnas y el sero significa as fukas)
# implace elimina las delas leres
df.drop(["total"],axis = 1, inplace = True)
print(df)

          tienda1  tienda2  tienda3
empresa1      NaN    100.0      200
empresa2      NaN    100.0      300
empresa3    100.0      NaN      233
empresa4      NaN    100.0      233

In [11]:
condicion = df > 200
print(df[condicion])

          tienda1  tienda2  tienda3
empresa1      NaN      NaN      NaN
empresa2      NaN      NaN    300.0
empresa3      NaN      NaN    233.0
empresa4      NaN      NaN    233.0

In [12]:
condicion = (df["tienda1"] >= 200 & (df["tienda2"]>100))
print(df[condicion])

          tienda1  tienda2  tienda3
empresa3    100.0      NaN      233

In [13]:
nuevacolumna = "1 2 3 4".split()
df["indice"] = nuevacolumna
df_2 = df
df

          tienda1  tienda2  tienda3 indice
empresa1      NaN    100.0      200      1
empresa2      NaN    100.0      300      2
empresa3    100.0      NaN      233      3
empresa4      NaN    100.0      233      4

In [14]:
df=df.set_index("indice")
df

        tienda1  tienda2  tienda3
indice
1           NaN    100.0      200
2           NaN    100.0      300
3         100.0      NaN      233
4           NaN    100.0      233

In [15]:

# eliminar valores nulos
eliminar_columnas_nulas = df.dropna(axis=1)
eliminar_columnas_nulas

        tienda3
indice
1           200
2           300
3           233
4           233

In [16]:
df.fillna(value=100, inplace=True)
df

        tienda1  tienda2  tienda3
indice
1         100.0    100.0      200
2         100.0    100.0      300
3         100.0    100.0      233
4         100.0    100.0      233

In [25]:
media = df.mean()
print(f"La media es iguala {media}")
df.fillna(value=media,inplace = True)
print(df)

La media es iguala tienda1    100.0
tienda2    100.0
tienda3    241.5
dtype: float64
        tienda1  tienda2  tienda3
indice
1         100.0    100.0      200
2         100.0    100.0      300
3         100.0    100.0      233
4         100.0    100.0      233

In [27]:
d1= df.copy()
d2= df.copy()
dt = pd.concat([d1,d2],axis=0)
dt

        tienda1  tienda2  tienda3
indice
1         100.0    100.0      200
2         100.0    100.0      300
3         100.0    100.0      233
4         100.0    100.0      233
1         100.0    100.0      200
2         100.0    100.0      300
3         100.0    100.0      233
4         100.0    100.0      233

In [29]:
print(df["tienda1"].unique())

[100.]

In [31]:
print(df["tienda1"].value_counts())

tienda1
100.0    4
Name: count, dtype: int64

In [33]:
dt = dt.apply(lambda x: x*3)
dt

        tienda1  tienda2  tienda3
indice
1         300.0    300.0      600
2         300.0    300.0      900
3         300.0    300.0      699
4         300.0    300.0      699
1         300.0    300.0      600
2         300.0    300.0      900
3         300.0    300.0      699
4         300.0    300.0      699

In [34]:
print(dt.columns)

Index(['tienda1', 'tienda2', 'tienda3'], dtype='object')

In [35]:
dt.index

Index(['1', '2', '3', '4', '1', '2', '3', '4'], dtype='object', name='indice')

In [36]:
# se ordenna condependiente al parametro
print(dt.sort_values(["tienda3"]))

        tienda1  tienda2  tienda3
indice
1         300.0    300.0      600
1         300.0    300.0      600
3         300.0    300.0      699
4         300.0    300.0      699
3         300.0    300.0      699
4         300.0    300.0      699
2         300.0    300.0      900
2         300.0    300.0      900

In [37]:
dt.describe()

       tienda1  tienda2     tienda3
count      8.0      8.0    8.000000
mean     300.0    300.0  724.500000
std        0.0      0.0  116.620263
min      300.0    300.0  600.000000
25%      300.0    300.0  674.250000
50%      300.0    300.0  699.000000
75%      300.0    300.0  749.250000
max      300.0    300.0  900.000000

In [ ]:
# para exportar el csv
# dt.to_csv("dt.csv")